<?php
// Ветвление. Оператор IF, ELSEIF, ELSE, Switch и тернарный оператор

$a = 155;
$b = "255";
$c = 255;
$d = 1001;
$e = 100;

echo "\n\n==================================== IF ====================================\n\n";

if ($a > 100) {
  echo "Переменная a больше чем 100", "\n";
}

if ($a <= 200) {
  echo "Переменная a меньше или равна 200", "\n";
}

if ($b == 255) {
  echo "Значение переменной b равно 255";
  echo "== нестрогое равенство", "\n";
}

if ($b === 255) {
  echo "Переменная b равна 255";
}

if ($c === 255) {
  echo "Переменная c равна 255", "\n";
  echo "=== строгое равенство", "\n";
}

if ($d != 1001) {
  echo "Переменная d не равна 100", "\n";
  echo "!= нестрогое неравенство", "\n";
}

if ($a !== "155") echo "Переменная a не равна строке 155", "\n";
if ($e % 2 === 0) echo "Переменная e четная", "\n";

echo "\n\n================================= IF ELSE ==================================\n\n";

$n = 45;
$p = 44;

if ($n % 2 === 0) {
  echo "Переменная even", "\n";
}
else {
  echo "Переменная odd", "\n";
}

if ($p % 2 === 0) echo "Переменная even", "\n";
else echo "Переменная odd", "\n";

// ---------------------------------------------------------------

$email = "poseidon@google.ru";
$password = "sjsujs8sis9";

if (strlen($password) > 8) {
  echo "пароль...ok", "\n";
}
else {
  echo "пароль...не ok", "\n";
}

if (strripos($email, "@") !== false) {
  echo "email...ok", "\n";
}
else {
  echo "email...не ok", "\n";
}

// ---------------------------------------------------------------

$t = 54;

if ($t >= 40 AND $t <= 65) echo "горячая вода", "\n";
if ($t <= -1 OR $t >= 101) echo "ошибка сигнала", "\n";

echo "\n\n============================= IF ELSEIF ELSE ===============================\n\n";

$s = 53;

if ($s < 45) echo "bronze", "\n";
elseif ($s < 75) echo "silver", "\n";
elseif ($s < 125) echo "gold", "\n";
else echo "vip", "\n";

if (true) {
  echo "Данный код всегда выводится", "\n";
}

if (!false) {
  echo "Данный код всегда выводится", "\n";
}

echo "\n\n=============================== SWITCH-CASE ================================\n\n";

$role = "moderator";

switch ($role) {
  case "admin":
    echo "полный контроль", "\n";
    break;
  case "moderator":
    echo "управление статьми и комментариями", "\n";
    break;
  case "user":
    echo "писать комментарии к статьям", "\n";
    break;
  default:
    echo "роль не найдена", "\n";
}

echo "\n\n=========================== ТЕРНАРНЫЙ ОПЕРАТОР =============================\n\n";

$result = 5;
$res;

$res = ($result === 5) ? 100 : 200;

echo $res, "\n";
