<?php
// Циклы в PHP, цикл for. Прерывание цикла, continue

echo "\n\n==================================== ЦИКЛ FOR =====================================\n\n";

for ($i = 0; $i < 10; $i++) {
  echo $i.' ';
}

echo "\n";

for ($i = 0; $i < 10; $i = $i + 2) {
  echo $i.' ';
}

echo "\n";

for ($i = 10; $i < 20; $i++) {
  echo $i.' ';
}

echo "\n";

for ($i = 20; $i >= 0; $i = $i - 1) {
  echo $i.' ';
}

echo "\n";

for ($b = 5; $b < 6; $b++) {
  echo 'work';
}

echo "\n";

for ($col = 'A'; $col != 'AA'; $col++) {
  echo $col.' ';
}

echo "\n";

echo "\n\n================================= ВЫХОД ИЗ ЦИКЛА ==================================\n\n";

for ($i = 50; $i <= 100; $i = $i + 10) {
  if ($i === 80) {
    break;
  }

  echo $i.' ';
}

echo "\n";

for ($i = 50; $i <= 100; $i = $i + 10) {
  echo $i.' ';

  if ($i === 80) {
    break;
  }
}

echo "\n\n============================= ПРОПУСК ИТЕРАЦИИ ЦИКЛА ==============================\n\n";

for ($i = 50; $i <= 100; $i = $i + 10) {
  if ($i === 80) {
    continue;
  }

  echo $i.' ';
}

echo "\n";

echo "\n\n=============================== ВЫВОД ПОСЛЕ ЦИКЛА =================================\n\n";

$out = '';

for ($i = 50; $i <= 100; $i = $i + 10) {
  $out .= $i.' ';
}

echo $out;

echo "\n";

$sum = 0;

for ($i = 10; $i <= 15; $i++) {
  $sum += $i;
}

echo $sum;

echo "\n";

$p = 1;

for ($i = 1; $i <= 5; $i++) {
  $p *= $i;
}

echo $p;
