<?php
// Функции для работы с массивами в PHP. Вся база

$t = [22, 33, 44];

print_r($t);

// добавляет элементы в конец ================================================================================================ array_push

$res = array_push($t, 55, 66, 77);

print_r($t);

echo $res, "\n";                              // -> 6 (возвращает длину массива)

$t[] = 99;

print_r($t);

// удаляет последний элемент  ================================================================================================= array_pop

$q = [22, 33, 44];

$res1 = array_pop($q);

print_r($q);
echo $res1, "\n";                             // -> 44 (возвращает удаленный элемент)

// добавляет элементы в начало ============================================================================================ array_unshift

$w = [22, 33, 44];

$res2 = array_unshift($w, 55, 66);

print_r($w);
echo $res2, "\n";                             // -> 5 (возвращает длину массива)

// удаляет первый элемент =================================================================================================== array_shift

$e = [22, 33, 44];

$res3 = array_shift($e);

print_r($e);
echo $res3, "\n";                             // -> 22 (возвращает удаленный элемент)

// поиск элемента (возвращает true / false) ==================================================================================== in_array

$r = [22, 33, 44];

$res4 = in_array(44, $r);
$res5 = in_array(55, $r);
$res6 = in_array('44', $r);
$res7 = in_array('44', $r, true);

var_dump($res4);                              // -> bool(true)
var_dump($res5);                              // -> bool(false)
var_dump($res6);                              // -> bool(true)
var_dump($res7);                              // -> bool(false)

// поиск элемента (возвращает индекс / false) ============================================================================== array_search

$a = [22, 33, 44, 33];

$res8 = array_search(44, $a);
$res9 = array_search(33, $a);
$res10 = array_search('44', $a);
$res11 = array_search('44', $a, true);

var_dump($res8);                              // -> int(2)
var_dump($res9);                              // -> int(1)  (вернет первый найденный элемент)
var_dump($res10);                             // -> int(2)
var_dump($res11);                             // -> bool(false)

// ========================================================================================================================= array_unique

$d = ['22', 33, 22, 33, 44, 55, 11, 11, 55];

$res12 = array_unique($d);

print_r($d);
print_r($res12);

var_dump($res12);                             // -> { [0] => string(2) "22" [1] => int(33) [4] => int(44) [5] => int(55) [6] => int(11) }

// ========================================================================================================================= array_filter

$f = [100, 22, 33, 44, 55, 66, 77, 88, 99];

function more ($item) {
  return $item > 60;
}

$res13 = array_filter($f, 'more');

$res14 = array_filter($f, function($item) {
  return $item > 60;
});

print_r($res13);                              // -> { [0] => 100 [4] => 66 [5] => 77 [6] => 88 [7] => 99 }
print_r($res14);                              // -> { [0] => 100 [4] => 66 [5] => 77 [6] => 88 [7] => 99 }

// ============================================================================================================================ array_map

$g = [22, 33, 44];

function two($item) {
  return $item * 2;
}

$res15 = array_map(function ($item) {
  return $item + 2;
}, $g);

$res16 = array_map('two', $g);

print_r($res15);                              // -> { [0] => 24 [1] => 35 [2] => 46 }
print_r($res16);                              // -> { [0] => 44 [1] => 66 [2] => 88 }
